app/controllers/books_controller.rb

  def create
    # １.&2. データを受け取り新規登録するためのインスタンス作成
    # book = Book.new(book_params)
    # # 3. データをデータベースに保存するためのsaveメソッド実行
    # book.save
    # # 4. トップ画面へリダイレクト
    # # redirect_to '/top'
    # redirect_to book_path(book.id)
    @book = Book.new(book_params)
    if @book.save
       flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "本が好き"], ["body", "どんな本が好きなのか統計をとってみた"], ["created_at", "2023-05-15 15:59:27.971230"], ["updated_at", "2023-05-15 15:59:27.971230"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
   if  @book.update(book_params)
    flash[:notice] = "Book was successfully created."
    redirect_to book_path(@book.id)
   else
    # 保存に失敗したとき
    flash[:alert] = "errors prohibited this book from being saved:"
    @books = Book.all
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "編集"], ["body", "編集機能"], ["updated_at", "2023-05-11 09:56:53.301585"], ["id", 17]]
SELECT "books".* FROM "books"